level-06/college_portal/app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections"
---
	def index
	    if params[:department_id]
	      @sections = Section.where(department_id: params[:department_id]).all
	    else
	      @sections = Section.all

SELECT "departments".* FROM "departments"
---
	  def new
	    @section = Section.new
	    @department_collection = Department.all.collect { |p| [p.name, p.id] }

INSERT INTO "sections" ("name", "created_at", "updated_at", "department_id") VALUES (?, ?, ?, ?)  [["name", "A"], ["created_at", "2019-10-26 16:30:55.610756"], ["updated_at", "2019-10-26 16:30:55.610756"], ["department_id", 980190963]]
---
	  def create
	    @section = Section.new(section_params)
	    if @section.save